slowpoke/synthetic/two-services/interference-microbenchmark/service0-d200-poker40000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=0
SLOWPOKE_DELAY_MICROS_SERVICE0=200
SLOWPOKE_POKER_BATCH_THRESHOLD=40000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   200.50ms  109.59ms 692.26ms   72.50%
    Req/Sec   307.96    168.72   730.00     67.23%
  Latency Distribution
     50%  186.77ms
     75%  254.23ms
     90%  335.10ms
     99%  655.66ms
  7324 requests in 3.02s, 2.93MB read
Requests/sec:   2428.01
Transfer/sec:      0.97MB
[run.sh] Speed is 2428.01, duration is 24
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d24s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 24s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   197.35ms   95.65ms 634.07ms   69.45%
    Req/Sec   326.60    200.59     0.95k    66.08%
  Latency Distribution
     50%  190.17ms
     75%  253.67ms
     90%  322.29ms
     99%  470.45ms
  40000 requests in 24.00s, 15.98MB read
Requests/sec:   1666.66
Transfer/sec:    681.96KB
------------------------------
stop time: 15.226563
stop time: 15.177263
stop time: 15.499290
stop time: 15.573291
stop time: 15.624526
stop time: 15.694067
stop time: 15.610445
stop time: 15.614202
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-fb49bcfd5-k6lkk         638m         45Mi            
service1-85fd58c4dc-6nqpd        54m          12Mi            
ubuntu-client-76886f6bbd-ndfdl   15m          0Mi             
[run.sh] Test finished with status 0